load-tests/artillery-boundary-test.yml
# BoundaryService 부하 테스트
# 서버 스펙: mi1-g3 (1vCPU, 1GB RAM, 2GB Swap)
# 목적: 100ms tick의 findConnectedGroups() 알고리즘 성능 검증
#
# BoundaryService 동작:
# - 100ms마다 모든 사용자 위치 기반으로 인접 그룹 계산
# - O(n²) 거리 계산: 200명 시 40,000번/tick
# - boundary:update 이벤트로 결과 브로드캐스트

config:
  target: "http://localhost:3000"
  phases:
    # Phase 1: 기본 부하 (인접 계산 워밍업)
    - duration: 30
      arrivalRate: 1
      name: "Phase 1 - 분산 배치 (1/s)"
    # Phase 2: 밀집 부하 (인접 계산 부하 증가)
    - duration: 60
      arrivalRate: 2
      name: "Phase 2 - 밀집 배치 시작 (2/s)"
    # Phase 3: 최대 밀집 (최악의 케이스)
    - duration: 60
      arrivalRate: 3
      name: "Phase 3 - 고밀집 (3/s)"
    # Phase 4: 복구 확인
    - duration: 30
      arrivalRate: 1
      name: "Phase 4 - 복구 (1/s)"
  engines:
    socketio-v3:
      transports: ["websocket"]

scenarios:
  # 시나리오 1: 밀집 배치 (boundary 알고리즘 부하 최대화)
  # 좁은 영역에 모든 사용자를 배치하여 인접 계산 부하 증가
  - name: "Dense clustering - boundary stress"
    weight: 7  # 70%
    engine: socketio-v3
    flow:
      - emit:
          channel: "room:join"
          data:
            roomId: "lobby"
      - think: 1
      # 좁은 범위 내에서 이동 (인접 판정 많이 발생)
      # 좌표: 500-600 범위 = 100px 내에 밀집
      - loop:
          - emit:
              channel: "player:move"
              data:
                x: "{{ $randomNumber(500, 600) }}"
                y: "{{ $randomNumber(900, 1000) }}"
                direction: "{{ $randomItem(['up', 'down', 'left', 'right']) }}"
                state: "walk"
          - think: 0.1  # 100ms마다 이동 (boundary tick과 동기화)
        count: 200  # 20초간 이동
      - think: 10

  # 시나리오 2: 분산 배치 (비교군)
  - name: "Scattered - baseline"
    weight: 3  # 30%
    engine: socketio-v3
    flow:
      - emit:
          channel: "room:join"
          data:
            roomId: "lobby"
      - think: 1
      # 넓은 범위에서 이동 (인접 판정 적게 발생)
      - loop:
          - emit:
              channel: "player:move"
              data:
                x: "{{ $randomNumber(100, 1900) }}"
                y: "{{ $randomNumber(100, 1600) }}"
                direction: "{{ $randomItem(['up', 'down', 'left', 'right']) }}"
                state: "walk"
          - think: 0.5
        count: 40
      - think: 10